spec/fixtures/files/stripe/subscription.json

{
  "id": "sub_ELUkl28VTwzaKf",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1547542731,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "created": 1547542731,
  "current_period_end": 1550221131,
  "current_period_start": 1547542731,
  "customer": "cus_ELUkWNFlMot9ht",
  "days_until_due": null,
  "default_source": null,
  "discount": null,
  "ended_at": null,
  "items": {"object":"list","data":[{"id":"si_ELUkY1xkqispV7","object":"subscription_item","created":1547542731,"metadata":{},"plan":{"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"subscription":"sub_ELUkl28VTwzaKf"}],"has_more":false,"total_count":1,"url":"/v1/subscription_items?subscription=sub_ELUkl28VTwzaKf"},
  "latest_invoice": {"id":"in_1F7enQHwuhGySQCdj1HN7n98","object":"invoice","account_country":"SE","account_name":"GoClimateNeutral.org","amount_due":360,"amount_paid":360,"amount_remaining":0,"application_fee_amount":null,"attempt_count":1,"attempted":true,"auto_advance":false,"billing":"charge_automatically","billing_reason":"subscription_cycle","charge":"ch_1F7fjtHwuhGySQCdAvD9Jedl","collection_method":"charge_automatically","created":1565859540,"currency":"usd","custom_fields":null,"customer":"cus_ELUkWNFlMot9ht","customer_address":null,"customer_email":"test@example.com","customer_name":null,"customer_phone":null,"customer_shipping":null,"customer_tax_exempt":"none","customer_tax_ids":[],"default_payment_method":null,"default_source":null,"default_tax_rates":[],"description":"Tack för du vill vara med och stoppa klimatförändringarna!\n\nBetala här: ","discount":null,"due_date":1568455165,"ending_balance":0,"footer":null,"hosted_invoice_url":"https://pay.stripe.com/invoice/invst_bphDuKrRr7AvDq92XZ3p97TK0K","invoice_pdf":"https://pay.stripe.com/invoice/invst_bphDuKrRr7AvDq92XZ3p97TK0K/pdf","lines":{"object":"list","data":[{"id":"sli_c640055aee13ed","object":"line_item","amount":360,"currency":"usd","description":"1 × Climate Offset 3.6 usd Monthly (at $3.60 / month)","discountable":true,"livemode":false,"metadata":{},"period":{"end":1568537931,"start_date":1565859531},"plan":{"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"amount_decimal":"360","billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"proration":false,"quantity":1,"subscription":"sub_ELUkl28VTwzaKf","subscription_item":"si_ELUkY1xkqispV7","tax_amounts":[],"tax_rates":[],"type":"subscription"}],"has_more":false,"total_count":1,"url":"/v1/invoices/in_1F7enQHwuhGySQCdj1HN7n98/lines"},"livemode":false,"metadata":{},"next_payment_attempt":null,"number":"8658A7C-0008","paid":true,"payment_intent":{"id":"pi_1F7fjsHwuhGySQCd6IqcNhb0","object":"payment_intent","amount":360,"amount_capturable":0,"amount_received":360,"application":null,"application_fee_amount":null,"canceled_at":null,"cancellation_reason":null,"capture_method":"automatic","charges":{"object":"list","data":[{"id":"ch_1F7fjtHwuhGySQCdAvD9Jedl","object":"charge","amount":360,"amount_refunded":0,"application":null,"application_fee":null,"application_fee_amount":null,"balance_transaction":"txn_1F7fjtHwuhGySQCdZu7iNKf2","billing_details":{"address":{"city":null,"country":null,"line1":null,"line2":null,"postal_code":null,"state":null},"email":null,"name":null,"phone":null},"captured":true,"created":1565863165,"currency":"usd","customer":"cus_ELUkWNFlMot9ht","description":"Payment for invoice 8658A7C-0008","destination":null,"dispute":null,"failure_code":null,"failure_message":null,"fraud_details":{},"invoice":"in_1F7enQHwuhGySQCdj1HN7n98","livemode":false,"metadata":{},"on_behalf_of":null,"order":null,"outcome":{"network_status":"approved_by_network","reason":null,"risk_level":"normal","risk_score":62,"seller_message":"Payment complete.","type":"authorized"},"paid":true,"payment_intent":"pi_1F7fjsHwuhGySQCd6IqcNhb0","payment_method":"src_1DsnkxHwuhGySQCdg4FB6mPp","payment_method_details":{"card":{"brand":"visa","checks":{"address_line1_check":null,"address_postal_code_check":null,"cvc_check":null},"country":"US","exp_month":5,"exp_year":2022,"fingerprint":"AFDR1kTX598pXWiQ","funding":"credit","last4":"4242","three_d_secure":null,"wallet":null},"type":"card"},"receipt_email":null,"receipt_number":null,"receipt_url":"https://pay.stripe.com/receipts/acct_1A09wWHwuhGySQCd/ch_1F7fjtHwuhGySQCdAvD9Jedl/rcpt_Fcvb0elb1toigVK04KPYTwvxFw23D3i","refunded":false,"refunds":{"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges/ch_1F7fjtHwuhGySQCdAvD9Jedl/refunds"},"review":null,"shipping":null,"source":{"id":"src_1DsnkxHwuhGySQCdg4FB6mPp","object":"source","amount":null,"card":{"exp_month":5,"exp_year":2022,"brand":"Visa","country":"US","fingerprint":"AFDR1kTX598pXWiQ","funding":"credit","last4":"4242","three_d_secure":"optional","name":null,"address_line1_check":null,"address_zip_check":null,"cvc_check":null,"tokenization_method":null,"dynamic_last4":null},"client_secret":"src_client_secret_ELUkA74mLvl5H8dhtGI5E6FY","created":1565863165,"currency":null,"customer":"cus_ELUkWNFlMot9ht","flow":"none","livemode":false,"metadata":{},"owner":{"address":null,"email":null,"name":null,"phone":null,"verified_address":null,"verified_email":null,"verified_name":null,"verified_phone":null},"statement_descriptor":null,"status":"chargeable","type":"card","usage":"reusable"},"source_transfer":null,"statement_descriptor":null,"statement_descriptor_suffix":null,"status":"succeeded","transfer_data":null,"transfer_group":null}],"has_more":false,"total_count":1,"url":"/v1/charges?payment_intent=pi_1F7fjsHwuhGySQCd6IqcNhb0"},"client_secret":"pi_1F7fjsHwuhGySQCd6IqcNhb0_secret_HSVdhIjucgXCLK7WQ7C0CRDnm","confirmation_method":"automatic","created":1565863164,"currency":"usd","customer":"cus_ELUkWNFlMot9ht","description":"Payment for invoice 8658A7C-0008","invoice":"in_1F7enQHwuhGySQCdj1HN7n98","last_payment_error":null,"livemode":false,"metadata":{},"next_action":null,"on_behalf_of":null,"payment_method":null,"payment_method_options":{"card":{"request_three_d_secure":"automatic"}},"payment_method_types":["card"],"receipt_email":null,"review":null,"setup_future_usage":null,"shipping":null,"source":"src_1DsnkxHwuhGySQCdg4FB6mPp","statement_descriptor":null,"statement_descriptor_suffix":null,"status":"succeeded","transfer_data":null,"transfer_group":null},"period_end":1565859531,"period_start":1563181131,"post_payment_credit_notes_amount":0,"pre_payment_credit_notes_amount":0,"receipt_number":null,"starting_balance":0,"statement_descriptor":null,"status":"paid","status_transitions":{"finalized_at":1565863164,"marked_uncollectible_at":null,"paid_at":1565863166,"voided_at":null},"subscription":"sub_ELUkl28VTwzaKf","subtotal":360,"tax":null,"tax_percent":null,"total":360,"total_tax_amounts":[],"webhooks_delivered_at":1565859540},
  "livemode": false,
  "metadata": {},
  "plan": {"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},
  "quantity": 1,
  "start_date": 1547542731,
  "status": "active",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}
