spec/fixtures/files/stripe/subscription_requires_action.json

{
  "id": "sub_EM3QInv2DcQ98K",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1550350102,
  "billing_thresholds": null,
  "cancel_at_period_end": false,
  "canceled_at": 1548940123,
  "created": 1547671705,
  "current_period_end": 1550350102,
  "current_period_start": 1547671705,
  "customer": "cus_EJLHNT0irJvqpI",
  "days_until_due": null,
  "default_source": null,
  "discount": null,
  "ended_at": 1548940123,
  "items": {"object":"list","data":[{"id":"si_EM3QheZkHr5hju","object":"subscription_item","billing_thresholds":null,"created":1547671706,"metadata":{},"plan":{"id":"climate_offset_4_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":400,"billing_scheme":"per_unit","created":1530449123,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_D9Nh2ZzUCO5pQP","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"subscription":"sub_EM3QInv2DcQ98K"}],"has_more":false,"total_count":1,"url":"/v1/subscription_items?subscription=sub_EM3QInv2DcQ98K"},
  "livemode": false,
  "metadata": {},
  "plan": {"id":"climate_offset_4_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":400,"billing_scheme":"per_unit","created":1530449123,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_D9Nh2ZzUCO5pQP","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},
  "quantity": 1,
  "start": 1547671705,
  "status": "incomplete",
  "latest_invoice": {"payment_intent":{"status":"requires_action","client_secret":"c_secret"}},
  "tax_percent": null
}
